{"type":"entity","entityType":"project","name":"scad-project","observations":["The project is a large OpenSCAD and BOSL2-based parametric modeling workspace, organized for 3D printing and CAD automation.","It uses a custom AppImage of OpenSCAD located in the bin folder for rendering and PNG output.","The workspace contains a 'packages' directory with many subfolders, each likely representing a parametric model or module (e.g., battery, bowl, box, bracket, etc.).","There is a strong emphasis on modularity and reuse, with a 'common' and 'modules' folder for shared code.","The project integrates Model Context Protocol (MCP) servers for memory and sequential thinking, configured in .vscode/mcp.json.","The memory MCP server uses a file-based backend at /home/andrew/scad/memory.jsonl.","The sequential thinking MCP server is also enabled, supporting advanced reasoning and planning workflows.","The workspace includes scripts for code maintenance (e.g., fix-line-endings.sh) and a genaisrc directory for AI-related configuration and package management.","README and documentation files are present, indicating a well-documented and collaborative project structure.","The project is designed for extensibility, with support for additional packages and modules.","The .vscode/mcp.json file configures two MCP servers: 'memory' (using @modelcontextprotocol/server-memory with a file backend) and 'sequential-thinking' (using @modelcontextprotocol/server-sequential-thinking).","The OpenSCAD AppImage in bin/ is version 2025.04.07.ai24751-x86_64, indicating use of a recent OpenSCAD build.","The workspace is Linux-based and uses bash as the default shell.","The packages directory contains a wide variety of parametric models, suggesting a focus on reusable, customizable 3D designs.","The project leverages BOSL2, a popular OpenSCAD library, for advanced modeling features and utilities.","Scripts and configuration files (e.g., fix-line-endings.sh, package.json, README.md) support code quality and project documentation.","The genaisrc directory appears to be related to AI or generative design tooling, possibly for automated model generation or configuration."]}